In [1]:
import pandas as pd

In [2]:
path ="https://github.com/KyungChic/DATA-ANALASIS/blob/main/Project2.%20%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D%20%EC%8B%A4%EB%AC%B4%20%ED%8C%8C%EC%9D%B4%EC%8D%AC/FILES/2_Data_Analysis_Basic/files/sample_1.xlsx?raw=true"

sample_1 = pd.read_excel(path)

print(sample_1.head(3),
    sample_1.tail(3))

  2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
0            국적코드         성별       입국객수       전년동기
1             A01         남성     106320      85815
2             A01         여성     191436     125241   2019년 11월 입국객 수 Unnamed: 1 Unnamed: 2 Unnamed: 3
6             A18         여성     232943     163466
7           총 합계      689972        NaN        NaN
8            전년동기     499361        NaN        NaN

In [3]:
sample_1 = pd.read_excel(path,
                         header = 1,  #(복습)header는 칼럼명이 속하는 row의 index를 나타낸다.
                         skipfooter = 2,
                         usecols = "A:C")

print(sample_1)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [4]:
#1 데이터 추가하기

sample_1['기준년월'] = "2019-11"

In [5]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [6]:
#2. 데이터 통합하기 - 옆으로 통합(merge)
## 엑셀의 VLOOKUP 기능

In [7]:
#2-1 국적코드 data 읽어오기

path = "https://github.com/KyungChic/DATA-ANALASIS/blob/main/Project2.%20%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D%20%EC%8B%A4%EB%AC%B4%20%ED%8C%8C%EC%9D%B4%EC%8D%AC/FILES/2_Data_Analysis_Basic/files/sample_codemaster.xlsx?raw=true"

code_master = pd.read_excel(path)

print(code_master)

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [8]:
#2-2 데이터 옆으로 통합(left조건)
## 국적코드 A31은 code_master에 존재하지 않으므로 NaN값으로 표기됨.

sample_1_code_left = pd.merge(left = sample_1,          #왼쪽은 sample_1 df로,
                             right = code_master,       #오른쪽은 code_master df로,
                             how = 'left',              #방식은 left에 해당하는 df 기준으로,
                             left_on = '국적코드',      #left의 기준 칼럼은 '국적코드'
                             right_on = '국적코드')     #right의 기준 칼럼은 '국적코드'

sample_1_code_left

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [9]:
#2-3 (실험) right 조건으로 통합해보기
## (결과) '국적코드'가 겹치는 row들이 먼저 출력되고 겹치지 않는 row들이 code_master에 존재하는 row기준으로 합해짐.

sample_1_code_right = pd.merge(left = sample_1,
                             right = code_master,
                             how = 'right',
                             left_on = '국적코드',
                             right_on = '국적코드')

print(code_master)
print(sample_1_code_right)

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타
  국적코드   성별      입국객수     기준년월     국적명
0  A01   남성  106320.0  2019-11      일본
1  A01   여성  191436.0  2019-11      일본
2  A18   남성  158912.0  2019-11      중국
3  A18   여성  232943.0  2019-11      중국
4  A02  NaN       NaN      NaN      대만
5  A03  NaN       NaN      NaN      홍콩
6  A19  NaN       NaN      NaN      이란
7  A22  NaN       NaN      NaN  우즈베키스탄
8  A23  NaN       NaN      NaN   카자흐스탄
9  A99  NaN       NaN      NaN  아시아 기타

In [10]:
#2-4 inner 조건으로 merge하기
## 존재하는 값만(NaN값 없이) merge함.  (cf. NaN = Not a Number)

sample_1_code_inner = pd.merge(left = sample_1,
                              right = code_master,
                              how = 'inner',
                              left_on = '국적코드',
                              right_on = '국적코드')

print(sample_1_code_inner)

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국

In [11]:
#3 데이터통합 - 아래로 통함 (APPEND)
##날짜별로 EXCEL 저장할 때가 많은데 시계열 분석을 위해서는 아래 방향의 통합 필요
### sample_1_code_inner df와 통합할 예정.

In [30]:
#3-1 sample2 파일 불러오기

path = "https://github.com/KyungChic/DATA-ANALASIS/blob/main/Project2.%20%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D%20%EC%8B%A4%EB%AC%B4%20%ED%8C%8C%EC%9D%B4%EC%8D%AC/FILES/2_Data_Analysis_Basic/files/sample_2.xlsx?raw=true"
sample_2 = pd.read_excel(path,
                        header = 1,
                        skipfooter = 2,
                        usecols = 'A:C')

In [31]:
sample_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
국적코드    4 non-null object
성별      4 non-null object
입국객수    4 non-null int64
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [32]:
sample_2.shape

(4, 3)

In [33]:
sample_2.head()

  국적코드  성별    입국객수
0  A01  남성   92556
1  A01  여성  163737
2  A18  남성  155540
3  A18  여성  249023

In [34]:
sample_2.tail()

  국적코드  성별    입국객수
0  A01  남성   92556
1  A01  여성  163737
2  A18  남성  155540
3  A18  여성  249023

In [41]:
#3-2. 동일한 형식으로 맞추어주기

sample_2['기준년월'] = '2019-12'

sample_2_merge = pd.merge(left = sample_2,
                         right = code_master,
                         how = 'inner',
                         left_on = '국적코드',
                         right_on = '국적코드')

sample_2_merge

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [42]:
#3-3. 합치기

sample_2_append = sample_1_code_inner.append(sample_2_merge, ignore_index= True)

sample_2_append

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국
4  A01  남성   92556  2019-12  일본
5  A01  여성  163737  2019-12  일본
6  A18  남성  155540  2019-12  중국
7  A18  여성  249023  2019-12  중국

In [43]:
#4. 데이터저장하기(to_excel)

sample_2_append.to_excel(r'C:\Users\Gargantua\Desktop\sample.xlsx', index = False)  #index=False 로 index가 저장되는 거 해제할 수 있음.

In [48]:
#5. 데이터 집계(pivot_table)

sample_pivot1 = sample_2_append.pivot_table(values = '입국객수',
                                           index = '국적명',
                                           columns = '기준년월',
                                           aggfunc = 'mean')

sample_pivot1

기준년월   2019-11   2019-12
국적명
일본    148878.0  128146.5
중국    195927.5  202281.5

In [54]:
#5-1. index만 지정해보기
#따로 column 지정하지 않아도 가능!

sample_pivot2 = sample_2_append.pivot_table(values = '입국객수',
                                            index = '국적명',
                                           aggfunc = 'max')

sample_pivot2

       입국객수
국적명
일본   191436
중국   249023

In [55]:
#5-2. columns만 지정해보기

sample_pivot3 = sample_2_append.pivot_table(values = '입국객수',
                                           columns = '기준년월',
                                           aggfunc = 'min')
sample_pivot3

기준년월  2019-11  2019-12
입국객수   106320    92556